---
title: LoadComponent
classe: Autodesk.Revit.DB.Structure.LoadComponent
namespace: Autodesk.Revit.DB.Structure
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# LoadComponent

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double Factor { get; set; }` | `loadComponent.Factor` | Double |
| `Boolean IsValidObject { get; }` | `loadComponent.IsValidObject` | Boolean |
| `ElementId LoadCaseOrCombinationId { get; set; }` | `loadComponent.LoadCaseOrCombinationId` | ElementId |
| `Void Dispose()` | `loadComponent.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```